docs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-10-10 Thu 19:50 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Roguelike Game in C++17</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Neel Raiyani [Roy Fokker]">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href="org.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Roguelike Game in C++17</h1>
<p class="subtitle">Introduction</p>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org02811fe">Goal of this project</a></li>
<li><a href="#org98c61c1">Influences on the approach</a></li>
<li><a href="#orgc1b8b46">Log of Code</a></li>
<li><a href="#orgc2e1ea3">References</a></li>
<li><a href="#orga7a32ca">Licence</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org02811fe" class="outline-2">
<h2 id="org02811fe">Goal of this project</h2>
<div class="outline-text-2" id="text-org02811fe">
<p>
This project documents my attempts at going through the process of making a 
Roguelike game in <code>Modern C++</code>. The associated source code lives in 
<a href="https://www.github.com/roy-fokker/roguelike">GitHub Repository</a>. At the end of each milestone, there will be a link to 
state of the repository to that point in time.
</p>

<p>
Code is heavily commented, so it should not require any "getting into writer's
mind" on reader's part. If some aspect is confusing to you, the dear reader, 
please open an issue on github repo. Alternatively you can reach out to me 
on <a href="irc://irc.afternet.org/#gamedev">Afternet.org's #GameDev IRC channel</a>.
</p>

<p>
All the code is written and tested on MS Windows OS, version 7 and 10. I do not
have a Apple MacOS nor do I have access to a GNU/Linux based OS. However, given 
that none of the code is utilizing Win32 specific functionality, it should be 
relatively easy to build this project on those OSes, given appropriate development
environment setup.
</p>
</div>
</div>

<div id="outline-container-org98c61c1" class="outline-2">
<h2 id="org98c61c1">Influences on the approach</h2>
<div class="outline-text-2" id="text-org98c61c1">
<p>
The project is based on and follows the approach taken/presented by <a href="http://www.rogueliketutorials.com/tutorials/tcod/">Roguelike Tutorials</a>
as well as the variant <a href="https://tomassedovic.github.io/roguelike-tutorial/index.html">Roguelike Tutorials in Rust</a>. Project uses the same library 
<code>libtcod</code> referred here on out as <code>tcod</code>.
</p>

<p>
The C++ code itself is written in <code>ISO Standard C++ 17</code>, it does not utilize any compiler
specific extensions. It is formatted in <code>Allman</code> style, with <code>snake_case</code> naming, and <code>TAB</code>
for indent and <code>SPACE</code> for alignment. On my machine <code>TAB Size</code> is configured to be <code>4</code>, you 
can change it for your specific preference. I prefer to use <code>Trailing Return Types</code> for 
method and function declarations and definitions. Other C++ coding guideline, loosely, 
being followed is <a href="http://isocpp.github.io/CppCoreGuidelines/CppCoreGuidelines">C++ Core Guidelines</a>. 
</p>
</div>
</div>

<div id="outline-container-orgc1b8b46" class="outline-2">
<h2 id="orgc1b8b46">Log of Code</h2>
<div class="outline-text-2" id="text-orgc1b8b46">
<ol class="org-ol">
<li value="0"><a href="0.Setup.html">Environment and project setup</a>.</li>
<li><a href="1.Starter.html">Console and moving around</a>.</li>
<li><a href="2.Entity_Map.html">The entity and the map</a>.</li>
<li><a href="3.Dungeon.html">Dungeon generation</a>.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc2e1ea3" class="outline-2">
<h2 id="orgc2e1ea3">References</h2>
<div class="outline-text-2" id="text-orgc2e1ea3">
<ul class="org-ul">
<li><a href="http://www.rogueliketutorials.com/tutorials/tcod/">Roguelike Tutorials</a></li>
<li><a href="https://tomassedovic.github.io/roguelike-tutorial/index.html">Roguelike Tutorials in Rust</a></li>
<li><a href="http://isocpp.github.io/CppCoreGuidelines/CppCoreGuidelines">C++ Core Guidelines</a></li>
<li><a href="https://en.cppreference.com/w/">C++ Reference</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga7a32ca" class="outline-2">
<h2 id="orga7a32ca">Licence</h2>
<div class="outline-text-2" id="text-orga7a32ca">
<p>
All code in this repo is marked as being under <a href="https://spdx.org/licenses/MIT.html">MIT licence</a>. Only the code i.e. <code>*.cpp</code>, <code>*.hpp</code> 
and <code>CMakeLists.txt</code>.
</p>
<hr>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Neel Raiyani [Roy Fokker]</p>
<p class="date">Created: 2019-10-10 Thu 19:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
